_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_Ресурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>УСОERP_Ресурсы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Рабочие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Механизмы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипМеханизма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_СтоимостьРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_СтоимостьРесурсов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтоимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_УстановкаСтоимостиРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_УстановкаСтоимостиРесурсов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УСОERP_СтоимостьРесурсов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Цены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтоимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
								<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаСтарая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсСтарый</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСтарая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСтараяРегУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсНовый</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаНовая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаНовая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаНоваяРегУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИзмененияЦены</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/УСОERP_Ресурсы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Дата = ТекущаяДата();
		
	ОбновитьЦеныНаСервере();
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЦеныНаСервере()
	
	//Отбор = Новый Структура;
	//Отбор.Вставить("Регистратор", Документы.УСОERP_УстановкаСтоимостиРесурсов.ПустаяСсылка());
	//МассивСтрокТЗ = БазовыеЦены.НайтиСтроки(Отбор);
	
	Отбор = Новый Структура;
	Отбор.Вставить("Редактировать", Истина);
	МассивИзмененныхСтрокТЗ = БазовыеЦены.НайтиСтроки(Отбор);
	
	Если НЕ МассивИзмененныхСтрокТЗ.Количество() Тогда
		Возврат;
	КонецЕсли;

	
	//Если МассивСтрокТЗ.Количество() = 0 И МассивИзмененныхСтрокТЗ.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли;

	//ТекОбъект = РеквизитФормыВЗначение("Объект");
	//ТекОбъект.Записать();
	//ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
	
	//Для Каждого ТекСтрока Из МассивСтрокТЗ Цикл
	//
	//	Попытка
	//		ДокументОбъект_УстановкаСтоимости = Документы.УСОERP_УстановкаСтоимостиРесурсов.СоздатьДокумент();
	//	Исключение
	//		ЗаписьЖурналаРегистрации("Ошибка! Не удалось создать документ: ""Установка стоимости ресурсов"".", 
	//								УровеньЖурналаРегистрации.Ошибка, 
	//								Метаданные.Документы.УСОERP_УстановкаСтоимостиРесурсов);
	//								Сообщить(ОписаниеОшибки());
	//		Продолжить;
	//	КонецПопытки;
	//	
	//	ДокументОбъект_УстановкаСтоимости.Дата			= Дата;
	//	ДокументОбъект_УстановкаСтоимости.Ответственный	= Пользователи.ТекущийПользователь();
	//	ДокументОбъект_УстановкаСтоимости.ВидЦены		= ТекСтрока.ВидЦены;
	//	ДокументОбъект_УстановкаСтоимости.Валюта  		= ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	//
	//	НоваяСтрока = ДокументОбъект_УстановкаСтоимости.Цены.Добавить();
	//	НоваяСтрока.Ресурс 				= Объект.Ссылка;
	//	НоваяСтрока.ОбъектСтоимости 	= ТекСтрока.ОбъектСтоимости;
	//	НоваяСтрока.ВалютаНовая 		= ТекСтрока.Валюта;
	//	НоваяСтрока.ЦенаНовая			= ТекСтрока.Стоимость;
	//	НоваяСтрока.ЦенаНоваяРегУчет	= ТекСтрока.Стоимость;
	//	НоваяСтрока.КурсНовый 			= ТекСтрока.Курс;
	//
	//	Попытка
	//		ДокументОбъект_УстановкаСтоимости.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	//	Исключение
	//		ЗаписьЖурналаРегистрации("Ошибка! Не удалось провести документ: ""Установка стоимости ресурсов"".", 
	//								УровеньЖурналаРегистрации.Ошибка, 
	//								Метаданные.Документы.УСОERP_УстановкаСтоимостиРесурсов);
	//								Сообщить(ОписаниеОшибки());
	//		Продолжить;
	//	КонецПопытки;
	//			
	//КонецЦикла;
	
	Для Каждого ТекСтрока Из МассивИзмененныхСтрокТЗ Цикл
		
		//Если МассивСтрокТЗ.Найти(ТекСтрока) = Неопределено И ЗначениеЗаполнено(ТекСтрока.Регистратор) И ТекСтрока.НомерСтроки >= 0 Тогда
			
		Если ЗначениеЗаполнено(ТекСтрока.Регистратор) Тогда
			//И ТекСтрока.НомерСтроки >= 0 Тогда   			
			Попытка
				ДокУстановкаСтоимости = ТекСтрока.Регистратор.ПолучитьОбъект();
			Исключение
				ЗаписьЖурналаРегистрации("Ошибка! Не удалось получить документ: ""Установка стоимости ресурсов"".", 
										УровеньЖурналаРегистрации.Ошибка, 
										Метаданные.Документы.УСОERP_УстановкаСтоимостиРесурсов);
										Сообщить(ОписаниеОшибки());
				Продолжить;
			КонецПопытки;
			
			ТЗ_Цен = ДокУстановкаСтоимости.Цены.Выгрузить(,);
			РедактируемаяСтрока = ТЗ_Цен.НайтиСтроки(Новый Структура("НомерСтроки", ТекСтрока.НомерСтроки));
			
			Если РедактируемаяСтрока.Количество() = 1 Тогда
				РедактируемаяСтрока = РедактируемаяСтрока[0];
			Иначе
				Продолжить;
			КонецЕсли;
			
			РедактируемаяСтрока.ОбъектСтоимости 	= ТекСтрока.ОбъектСтоимости;
			РедактируемаяСтрока.ВалютаНовая 		= ТекСтрока.Валюта;
			РедактируемаяСтрока.ЦенаНоваяРегУчет 	= ТекСтрока.Стоимость;
			РедактируемаяСтрока.ЦенаНовая 			= ТекСтрока.Стоимость;
			ДокУстановкаСтоимости.ВидЦены			= ТекСтрока.ВидЦены;
			
			ДокУстановкаСтоимости.Цены.Загрузить(ТЗ_Цен);
			
			Попытка
				ДокУстановкаСтоимости.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				ЗаписьЖурналаРегистрации("Ошибка! Не удалось перезаписать документ: ""Установка стоимости ресурсов"".", 
										УровеньЖурналаРегистрации.Ошибка, 
										Метаданные.Документы.УСОERP_УстановкаСтоимостиРесурсов);
										Сообщить(ОписаниеОшибки());
				Продолжить;
			КонецПопытки;
			
		ИначеЕсли ТекСтрока.Стоимость > 0 Тогда
			
		Попытка
			ДокументОбъект_УстановкаСтоимости = Документы.УСОERP_УстановкаСтоимостиРесурсов.СоздатьДокумент();
		Исключение
			ЗаписьЖурналаРегистрации("Ошибка! Не удалось создать документ: ""Установка стоимости ресурсов"".", 
									УровеньЖурналаРегистрации.Ошибка, 
									Метаданные.Документы.УСОERP_УстановкаСтоимостиРесурсов);
									Сообщить(ОписаниеОшибки());
			Продолжить;
		КонецПопытки;
		
		ДокументОбъект_УстановкаСтоимости.Дата			= Дата;
		ДокументОбъект_УстановкаСтоимости.Ответственный	= Пользователи.ТекущийПользователь();
		ДокументОбъект_УстановкаСтоимости.ВидЦены		= ТекСтрока.ВидЦены;
		ДокументОбъект_УстановкаСтоимости.Валюта  		= ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
		НоваяСтрока = ДокументОбъект_УстановкаСтоимости.Цены.Добавить();
		НоваяСтрока.Ресурс 				= Объект.Ссылка;
		НоваяСтрока.ОбъектСтоимости 	= ТекСтрока.ОбъектСтоимости;
		НоваяСтрока.ВалютаНовая 		= ТекСтрока.Валюта;
		НоваяСтрока.ЦенаНовая			= ТекСтрока.Стоимость;
		НоваяСтрока.ЦенаНоваяРегУчет	= ТекСтрока.Стоимость;
		НоваяСтрока.КурсНовый 			= ТекСтрока.Курс;
	
		Попытка
			ДокументОбъект_УстановкаСтоимости.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			ЗаписьЖурналаРегистрации("Ошибка! Не удалось провести документ: ""Установка стоимости ресурсов"".", 
									УровеньЖурналаРегистрации.Ошибка, 
									Метаданные.Документы.УСОERP_УстановкаСтоимостиРесурсов);
									Сообщить(ОписаниеОшибки());
			Продолжить;
		КонецПопытки;

		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьЦеныНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЦены(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка)
		ИЛИ Модифицированность Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаписатьОбъектЗавершение", ЭтотОбъект), "Для заполнения регистра сведений ""Стоимость ресурсов"" текущий ресурс должен быть записан. Сохранить изменения?", РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да);
	Иначе
		ЗаписатьЦеныНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьОбъектЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьЦеныНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура История(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ресурс", 		Объект.Ссылка);
	
	ОткрытьФорму("Справочник.УСОERP_Ресурсы.Форма.ФормаИстория", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЦеныНаСервере()
	
	Запрос = Новый Запрос; 	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УСОERP_РесурсыРабочие.Должность КАК ОбъектСтоимости
	|ПОМЕСТИТЬ ВрТабРабочиеМеханизмы
	|ИЗ
	|	Справочник.УСОERP_Ресурсы.Рабочие КАК УСОERP_РесурсыРабочие
	|ГДЕ
	|	УСОERP_РесурсыРабочие.Ссылка = &Ссылка
	|	И УСОERP_РесурсыРабочие.Должность <> ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	УСОERP_РесурсыРабочие.Должность
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УСОERP_РесурсыМеханизмы.ТипМеханизма
	|ИЗ
	|	Справочник.УСОERP_Ресурсы.Механизмы КАК УСОERP_РесурсыМеханизмы
	|ГДЕ
	|	УСОERP_РесурсыМеханизмы.Ссылка = &Ссылка
	|	И УСОERP_РесурсыМеханизмы.ТипМеханизма <> ЗНАЧЕНИЕ(Справочник.ТипыТранспортныхСредств.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	УСОERP_РесурсыМеханизмы.ТипМеханизма
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыЦен.Ссылка КАК ВидЦены,
	|	ВрТабРабочиеМеханизмы.ОбъектСтоимости КАК ОбъектСтоимости
	|ПОМЕСТИТЬ ВидыЦен
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен,
	|	ВрТабРабочиеМеханизмы КАК ВрТабРабочиеМеханизмы
	|ГДЕ
	|	НЕ ВидыЦен.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(УСОERP_СтоимостьРесурсовСрезПоследних.Регистратор.Дата, ДЕНЬ) = &Дата
	|			ТОГДА УСОERP_СтоимостьРесурсовСрезПоследних.Регистратор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Регистратор,
	|	УСОERP_СтоимостьРесурсовСрезПоследних.ОбъектСтоимости КАК ОбъектСтоимости,
	|	УСОERP_СтоимостьРесурсовСрезПоследних.ВидЦены КАК ВидЦены,
	|	УСОERP_СтоимостьРесурсовСрезПоследних.Валюта КАК Валюта,
	|	СУММА(УСОERP_СтоимостьРесурсовСрезПоследних.Стоимость) КАК Стоимость,
	|	ЛОЖЬ КАК Редактировать,
	|	ЕСТЬNULL(УСОERP_УстановкаСтоимостиРесурсовЦены.НомерСтроки, -1) КАК НомерСтроки
	|ПОМЕСТИТЬ ВрТабРегистра
	|ИЗ
	|	РегистрСведений.УСОERP_СтоимостьРесурсов.СрезПоследних(&Дата, Ресурс = &Ссылка) КАК УСОERP_СтоимостьРесурсовСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УСОERP_УстановкаСтоимостиРесурсов.Цены КАК УСОERP_УстановкаСтоимостиРесурсовЦены
	|		ПО УСОERP_СтоимостьРесурсовСрезПоследних.Регистратор = УСОERP_УстановкаСтоимостиРесурсовЦены.Ссылка
	|			И УСОERP_СтоимостьРесурсовСрезПоследних.Ресурс = УСОERP_УстановкаСтоимостиРесурсовЦены.Ресурс
	|			И УСОERP_СтоимостьРесурсовСрезПоследних.ОбъектСтоимости = УСОERP_УстановкаСтоимостиРесурсовЦены.ОбъектСтоимости
	|			И УСОERP_СтоимостьРесурсовСрезПоследних.Валюта = УСОERP_УстановкаСтоимостиРесурсовЦены.ВалютаНовая
	|			И УСОERP_СтоимостьРесурсовСрезПоследних.ВидЦены = УСОERP_УстановкаСтоимостиРесурсовЦены.Ссылка.ВидЦены
	|
	|СГРУППИРОВАТЬ ПО
	|	УСОERP_СтоимостьРесурсовСрезПоследних.ОбъектСтоимости,
	|	УСОERP_СтоимостьРесурсовСрезПоследних.Валюта,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(УСОERP_СтоимостьРесурсовСрезПоследних.Регистратор.Дата, ДЕНЬ) = &Дата
	|			ТОГДА УСОERP_СтоимостьРесурсовСрезПоследних.Регистратор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	УСОERP_СтоимостьРесурсовСрезПоследних.ВидЦены,
	|	УСОERP_УстановкаСтоимостиРесурсовЦены.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыЦен.ВидЦены КАК ВидЦены,
	|	ВрТабРегистра.Регистратор КАК Регистратор,
	|	ВидыЦен.ОбъектСтоимости КАК ОбъектСтоимости,
	|	ЕСТЬNULL(ВрТабРегистра.Валюта, ВидыЦен.ВидЦены.ВалютаЦены) КАК Валюта,
	|	ЕСТЬNULL(ВрТабРегистра.Стоимость, 0) КАК Стоимость,
	|	ВрТабРегистра.Редактировать КАК Редактировать,
	|	ЕСТЬNULL(ВрТабРегистра.НомерСтроки, 0) КАК НомерСтроки
	|ИЗ
	|	ВидыЦен КАК ВидыЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВрТабРегистра КАК ВрТабРегистра
	|		ПО ВидыЦен.ВидЦены = ВрТабРегистра.ВидЦены
	|			И ВидыЦен.ОбъектСтоимости = ВрТабРегистра.ОбъектСтоимости
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидЦены,
	|	ОбъектСтоимости";
	
	Запрос.УстановитьПараметр("Дата", 			Дата);
	Запрос.УстановитьПараметр("Ссылка", 		Объект.Ссылка);
	
	БазовыеЦены.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦены(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьЦеныНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбновитьЦены(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура БазовыеЦеныПередУдалением(Элемент, Отказ)
		
	Отказ = Истина;
	
КонецПроцедуры

&НаСервере
Процедура БазовыеЦеныПередУдалениемНаСервере(ИндексСтроки)
	
	ТекущиеДанные = БазовыеЦены.Получить(ИндексСтроки);
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	ТекОбъект.Записать();
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Регистратор) Тогда
		
		Попытка
			ДокУстановкаСтоимости = ТекущиеДанные.Регистратор.ПолучитьОбъект();
		Исключение
			ЗаписьЖурналаРегистрации("Ошибка! Не удалось получить документ: ""Установка стоимости ресурсов"".", 
									УровеньЖурналаРегистрации.Ошибка, 
									Метаданные.Документы.УСОERP_УстановкаСтоимостиРесурсов);
									Сообщить(ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
		ТЗ_Цен = ДокУстановкаСтоимости.Цены.Выгрузить(,);
		ЦеныНаУдаление = ТЗ_Цен.НайтиСтроки(Новый Структура("Ресурс, ОбъектСтоимости, ЦенаНовая, ВалютаНовая", Объект.Ссылка, ТекущиеДанные.ОбъектСтоимости, ТекущиеДанные.Стоимость, ТекущиеДанные.Валюта));
		Для Каждого ТекСтрокаЦена Из ЦеныНаУдаление Цикл
			ТЗ_Цен.Удалить(ТекСтрокаЦена);
		КонецЦикла;
		ДокУстановкаСтоимости.Цены.Загрузить(ТЗ_Цен);
		
		Попытка
			ДокУстановкаСтоимости.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			ЗаписьЖурналаРегистрации("Ошибка! Не удалось перезаписать документ: ""Установка стоимости ресурсов"".", 
									УровеньЖурналаРегистрации.Ошибка, 
									Метаданные.Документы.УСОERP_УстановкаСтоимостиРесурсов);
									Сообщить(ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
	Иначе
		БазовыеЦены.Удалить(ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БазовыеЦеныПриИзменении(Элемент)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		Элемент.ТекущиеДанные.Редактировать = Истина;
		//Модифицированность 					= Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура БазовыеЦеныПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И Копирование Тогда
		Элемент.ТекущиеДанные.Редактировать = Истина;
		Элемент.ТекущиеДанные.Регистратор	= Неопределено;
		//Модифицированность 					= Истина;
		Элемент.ТекущиеДанные.НомерСтроки 	= -1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура БазовыеЦеныОбъектСтоимостиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокВыбора = Новый СписокЗначений;
	
	Для Каждого ТекСтрока Из Объект.Рабочие Цикл
		СписокВыбора.Добавить(ТекСтрока.Должность, Строка(ТекСтрока.Должность));
	КонецЦикла;
	
	Для Каждого ТекСтрока Из Объект.Механизмы Цикл
		СписокВыбора.Добавить(ТекСтрока.ТипМеханизма, Строка(ТекСтрока.ТипМеханизма));
	КонецЦикла;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИндексСтроки", БазовыеЦены.Индекс(Элемент.Родитель.ТекущиеДанные));
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("БазовыеЦеныОбъектСтоимостиНачалоВыбораЗавершение", ЭтотОбъект, ДополнительныеПараметры), СписокВыбора, Элементы.БазовыеЦеныОбъектСтоимости);

КонецПроцедуры

&НаКлиенте
Процедура БазовыеЦеныОбъектСтоимостиНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено И ДополнительныеПараметры.Свойство("ИндексСтроки") Тогда
		ТекущиеДанные = БазовыеЦены.Получить(ДополнительныеПараметры.ИндексСтроки);
		ТекущиеДанные.ОбъектСтоимости 		= ВыбранныйЭлемент.Значение;
		Элементы.БазовыеЦены.ТекущийЭлемент = Элементы.БазовыеЦены.ПодчиненныеЭлементы.БазовыеЦеныВидЦены;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура БазовыеЦеныПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура БазовыеЦеныСтоимостьПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура БазовыеЦеныПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Элементы.БазовыеЦены.ТекущиеДанные.Редактировать = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЗавершениеРаботы Тогда
		
		Строки = БазовыеЦены.НайтиСтроки(Новый Структура("Редактировать",Истина));
		
		Если Строки.Количество() Тогда
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемПродолжение",ЭтотОбъект);
			
			Отказ = Истина;
			ПоказатьВопрос(ОписаниеОповещения,"Цены были изменены, закрыть без сохранения?",РежимДиалогаВопрос.ДаНет); 			
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
Процедура ПередЗакрытиемПродолжение(Ответ,ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Строки = БазовыеЦены.НайтиСтроки(Новый Структура("Редактировать",Истина));
	Для Каждого НайденнаяСтрока ИЗ Строки Цикл
		НайденнаяСтрока.Редактировать = Ложь;
	КонецЦикла;
	
	Закрыть();
	
КонецПроцедуры


#КонецОбласти
